[{"body": "I am a user of a Galaxy note 3 that is 1.5 years old. I am a very heavy user who does a lot of calls and have whopping 29 gmail accounts (push always on), WhatsApp, Skype running at all times and this phone is the only one that lasts mr through the day.After an year the battery got weak but I easily changed it at home as it is user replaceable - ah the joy of having a phone with removable battery - take that Apple phones who charge 7-8k for replacing battery! I got mine from amazon for under 1500 directly from Samsung.This is a rock solid phone and none of its parts will fail - just make sure not to use it roughly and always have a metal bumper case around its sides.The bumper case will serve two purposes: 1st it will make your phone look cool (I got silver one for my black note 3) and elegant. Second it prevents the chrome from getting damaged.Verdict - This is the best phone on the market till now that does not compromise on performance and battery life.", "date": "13 June 2015", "author": "Kamaldeep Singh", "rating": "5.0 out of 5 stars", "title": "Long time user review"},
{"body": "I'm rating this drvice after a long use. The device is good from specs but as you know that the Samsung devices laggs too much. I was using the device from a long time and when i bought it, it works perfectly for the couple of weeks but after a month later, the device starts lagging too much which is not good for any consumer. The camera quality is really very impressive but it gets dull in low light. The device comes with 3GB of RAM but still it laggs. I have rated it 3 stars according to its specs and i must suggest to you that don't go for it. The device will completely disappoint you...", "date": "18 May 2015", "author": "Rishabh A.", "rating": "3.0 out of 5 stars", "title": "Tech Reviewer"},
{"body": "Lollipop update killed this phone. Higher ram usage and overheating  problems.", "date": "1 June 2015", "author": "nimesh garg", "rating": "4.0 out of 5 stars", "title": "Lollipop  update"},
{"body": "NOTE: Samsung gets 0 stars, the phone gets 5 stars, even 6.The Note 3 is awesome, but customers should be upset over the SIMM lock on it, and NOT get this N9000 model. The N9005 or a carrier model is the only way to go.This international version is not for US users or even US users who travel. If you are not a traveler forget the comments about it being region locked.I still say 99.9% of all people who get the Note 3 could not care less if the international version is region locked. However, this model, if you expect to use it in other countries has resulted in a thousand problems, literally. The phone is neutral but when it is activated the SIMM locks in the region and you cannot use it elsewhere. Do not think \"unlocked\" means you have magical usage. There is NO universal phone (except for spies), although some phones use other country SIMM cards -- but not this one! I get a US carrier phone, travel internationally, and keep my phone in airplane mode and use WIFI or get a phone card.Get the scoop. Do a search for XDA-Developers dot com, and go to the site. This is where the big boys and girls hang, for programming, not dumb questions.Type in Galaxy Note 3 in the field for the phone you desire.In the Forums, go to galaxy note 3 general.Search down the page to the thread \"SIMM restrictions on unlocked European Note 3.\" This thread has over 1300 posts. Yes this is a big problem.Read the first half dozen pages and the last 10 pages, but also check especially posts 1041 through 1045, and pages 117 and 18.This N9000 phone is the international or European version. It was released 2-3 weeks prior to the US versions, it is NOT LTE it is 3G; it has a different CPU -the Samsung Exynos 5 processor, not the Qualcom Snapdragon 800. US residents should not get it. We need to get a phone activated for our respective carriers, which changes the last digit of the number. Search Amazon for the Note 3 for your carrier. Notice the different last digit.Amazon may be confusing people by not listing the phone for what it really is and they need to change that in the title of the phone. The black version does say 'International\" in the title and so should the white one.Now, down to business.First, I am not affiliated with Samsung in any way, nor do I work for a cell phone store. I am a writer though.Secondly, I hate long reviews where the poster just reports the specs you already have. Rather, these comments show why the Galaxy Note 3 is more technologically advanced, and more phone for your money, compared to the many good phones on the market today, and the not so good phones, like the cave phone (that's what I call it) that does nothing.1. The beautiful 5.7\" Super Amoled HD display has a \"Wow!\" factor. Everything is crisp and clear with a resolution of 1920 x 1080P, 386 PPI. Despite a few good contenders, no phone on the market can match the combination of vibrant color, and deep blacks. Check it out for yourself. For those who prefer drab, you can even adjust color intensity and contrast.Is this practical? You bet. You get more viewable data for all social networking apps; you can see more email and contacts without scrolling; browsing is quick and pages more visible; YouTubes and video are fantastic; games are more playable; you can see larger areas on GPS maps; you get a better view of radar in weather; (live) wallpapers look great; you can use it as a reader; you can multitask with it; and with the right productivity apps you can even get some work done on it. I will never go back to a small screen phone.2. The CPU in the US versions is the quad core Qualcomm Snapdragon 800 @ 2.3, which is the fastest processor on the planet as of this time. It will perform well for years to come. A few other phones have it. The international version uses the Samsung Exynos 5 processor. It also has another quad core processors making it octa core, but it is still not quite as fast as the Snapdragon.3. The Adreno 330 GPU is the best on the market, a few other phones have it. It is 50% faster than the Adreno 320 in the Galaxy S4 which is a screamer.4. It's the only phone to come with 3 GB of DDR 3 RAM. It also comes standard with 32 gigs of storage and you can add more with an SD card. Note: No extra charges for these!5. It has a great 13 megapixel camera with useful software, a BSI Sensor, Smart Digital Stabilization and high CRI LED. Very few phones have this. It is also the only phone to do 4K video right now - sharp!6. No other phone has USB 3.0. 2 advantages: the phone charges very quickly on the 2 amp charger and nice thick cable. File transfer times are faster. With USB 3.0, a 2 gig file takes 27 seconds from the Note 3 to my (high end) PC. With USB 2.0 the same file takes 57 seconds.7. How many phones have an S Pen? Except for email and quick notes, I seldom used the S Pen on my original Galaxy Note, but the Note 3 comes with some useful software making it more functional, and the handwriting recognition is scary accurate.8. How many phones have a huge 3200 mA battery? It easily lasts all day with moderate to heavy use despite the large screen. Hardware and software improvements make the 100 mA bump over the Note 2 even more significant. You can also open the back and change out the battery - unlike some phones.9. It does infrared remote control. It also has TV-out (via MHL A/V link), Accelerometer, gyro, proximity, compass, barometer, temperature, humidity, and gesture sensor. I'm serious people, you get more for your money.10. Hello multitasking! The fast CPU & GPU, extra memory, and high-resolution 5.7 inch screen make multitasking feasible and fun on a cell phone. You can even scroll through multiple applications in each split screen. This is even better if you hook up a keyboard and mouse via Bluetooth or USB, and connect through HDMI to your TV or computer monitor. The Note 3 can actually serve as a small computer. How many phones can do that? You can also mirror the phone screen with your smart TV for internet, games, viewing pics, whatever.11. This the best cell phone for gaming on the market , period. The above features and OpenGL 3.0 which is part of Android 4.3 make it happen. Don't believe me? Read the reviews, watch the you tubes, and compared it for yourself.12. It doesn't just have GPS, it also uses A GPS (improved), and Glonass Satellites. DL a GPS satellite app, and you'll see it will access between 5 and 25 satellites at once depending on time of day and location.13. Got Knox? No, you don't. This phone provides business enterprise, and government level security for boot, VPN, etc., and comes in handy for privacy on public Wi-Fi. You don't have to use it, but it is there.14. The air command and air gesture features make the phone futuristic. How many phones do that?15. Is the screen too large for one handed operation? Yes, but so what? The tradeoff is worth it. Besides, Samsung now includes software to shrink it for one-handed so you get the best of both worlds.There are 2 things that Samsung needs to improve in my opinion. I don't know how many thousands of people need to tell them that putting the volume rockers directly opposite the power button is inconvenient for users. The Note 2 placement was better but still wrong. (I do like the new speaker placement though. Its perfect for horizontal viewing because your hand channels the sound to the user).This phone should also be waterproof right out-of-the-box. Not a scaled-down version, just waterproof the thing. Other manufacturers are doing it for their flagship phones. That means Samsung can do it too. Truth be known, we users never want to see another flagship phone that is not waterproof. It's doable, so please do it. Smoke it with that nano-whatever waterproofing stuff. You went to CES. (Oh, and S voice is still sorry, use Google voice)All that said, I'm very, very, happy with the Note 3. IMHO the Note 3 is so powerful and functional, it is the first device I would classify as a hand held computer. As a professor, I researched it for days and used the original Galaxy Note for over a year now. There are other good phones, but the Note 3 does it in one package, and in almost all cases does it better, for the same flag-ship- phone price. I feel sorry for the fanboys and people believing advertising hype who don't research the market. They pay top dollar but don't get their money's worth. Amazon is a great place to get your money's worth and to find out user information. Thanks Amazon.Oh yeah, almost forgot to mention, it's a really good phone too.", "date": "21 June 2014", "author": "aguy", "rating": "4.0 out of 5 stars", "title": "Great phone . Period."},
{"body": "Great display but overpriced! Bought it only for business use otherwise for personal use there are a whole lot of options out there!", "date": "16 October 2014", "author": "Tausif Kazi", "rating": "5.0 out of 5 stars", "title": "Great display but overpriced"},
{"body": "One of the best phone I have seen.. before using this phone I was using xperia z1 which was worst phone when compared to note 3 . Note 3 has many options apart from spending time on gaming. S pen is wonderful to use. It has special note option which will act like our diary where we can record our child activities with pics and more colorful template to each and every page. It has so many options to play around . Example eye sensor will stop playing videos when u turn ur face away from the device . S voice from Samsung is also excellent . It's worth for every penny . If we find less than 4 star in a review I'm sure that they have not used this device.Pros : excellent display with 5.7 inch . S pen . Performance . Camera , both picture and video quality is too good. So many useful options to play around .", "date": "7 July 2015", "author": "Ponraj", "rating": "5.0 out of 5 stars", "title": "One of the best phone I have seen"},
{"body": "Great phone at this price. I have used note 3 for about a year now and have not faced a single issue. The phone still does not lags. Yes the battery performance has been degraded after the lollipop update but still it is way better that other android devices and ofcos iphone. In about a year the phone has only hangged twice and that is when i had many apps oppened. The memory usage has been very high and stays at a higher level all the time after the lollipop update and the phone gets heated up really quick, but it does not affect the performance or battery.", "date": "5 July 2015", "author": "Ayrijit Swain", "rating": "4.0 out of 5 stars", "title": "Great phone at this price"},
{"body": "This is the first time I have bought a phone from either Amazon or Croma.Samsung Galaxy Note 3.Thought it was a good deal.Turns out a defective piece.Giving trouble in less than 24 hrs!Back button \"misses\". Random vibration signals and app closures.Took it to a Samsung dealer. Reloaded the software. No use. Says screen is defectiveIs that why it was on offer? Offloading defective crap online?Who is responsible? Croma? Amazon? Samsung?Never again Amazon.Where are minus stars?Back to good old Flipkart", "date": "9 May 2014", "author": "GB", "rating": "1.0 out of 5 stars", "title": "Offloading defective pieces online?"},
{"body": "I have bought this phone expecting great performance considering it comes from a big brand like Samsung however I am really disappointed by the phones performance, it keeps getting slow and it takes ages to switch between applications. Battery backup isnt great either.in the hindsight I now think I should have gone for Apple or Moto X.Really Disappointed!!!", "date": "27 June 2014", "author": "Harmeet", "rating": "2.0 out of 5 stars", "title": "Keeps getting suck"},
{"body": "Not supports for 4G,overheating issues as normal like all electronic (radiation range high),audio quality must be improved as I review", "date": "12 June 2015", "author": "laksusi", "rating": "1.0 out of 5 stars", "title": "True review"},
{"body": "Hi guys I am not satisfied with galaxy grand all the times phone will hang automatically re start . rating 2 star", "date": "5 October 2014", "author": "rohitbudhiraja", "rating": "5.0 out of 5 stars", "title": "Hi guys I am not satisfied with galaxy grand all the times phone will hang ..."},
{"body": "Device is to good in SpecificationsCamera Quality is GoodDisplay Quality is GreatPreloaded Application is UsefulUniversal Remote Works GreatThe Sensor's are Fully loaded Awesome Work by Samsung TeamJust The Issues is with BATTERY  LIFE after Charging the device 100 % and unplugged the device after 2 to 3 mins it will be 98 or 97%", "date": "25 July 2015", "author": "Pratik Arun Jadhav", "rating": "2.0 out of 5 stars", "title": "Battery Drains Fully Without Using The Device in 8 to 9 hours"},
{"body": "NICE SET TO USE. BUT A LITTLE TOO EXPENSIVE. KEEP U THE GOOD JOB, A LITTLE HEATING PROBLEM OTHERWISE NICE SET.", "date": "16 May 2014", "author": "PRASHANT", "rating": "5.0 out of 5 stars", "title": "NOTE 3 5 STARS"},
{"body": "Price is very high. So, it is useful only when priced at 20k or also providing 4G. Samsung makes us fool by charging very high price and its prices are falling very slowly.", "date": "19 September 2014", "author": "PRICE", "rating": "1.0 out of 5 stars", "title": "Price"},
{"body": "I am not satisfied with this product even I found some problems in it which disappointed me most of time.", "date": "19 May 2014", "author": "Anshuman Tiwari", "rating": "1.0 out of 5 stars", "title": "problem in product"},
{"body": "Hi, I got the 9005 version from ebay. Phone is great,  smooth. Good multitasking, display, battery backup, design(5out of 5). Camera could be better (4.0 out of 5). There is no manual Control over the camera (my L620 used to have this feature).  Launched in 2013, the specs beats even today's  present phone.", "date": "1 August 2015", "author": "vishwanath", "rating": "5.0 out of 5 stars", "title": "Good phone"},
{"body": "No, I did not buy this on Amazon.in.I took a very long time to make the decision, and when I finally decided on the Note, I wasnt sure of which one. The latest one offered LTE, which seems to be on the anvil and a ginormous display resolution. There were other key improvements like yhe pressure sensitivity of the tablet, camera, fingerprint sensor etc, which did not matter to me as much as the 20K savings.Hence, with careful cost-benefit analysis, I decided on the Note3 and at the same time invested in original flip cover, as well as OTG cable. Once I switched it on, I was at peace, given its astounding resolution, deep blacks (Super Amoleds Rock), and handful of applications all oriented towards someone like me...more work and serious stuff than games and chatting.This is a middle aged mans phone, it has everything I wanted to do things quick, and more. Together with the Tab S, I have an unbeatable pair of devices that just work fantastic, look gorgeous and are marvels of software technology in their own rights.", "date": "3 February 2015", "author": "Milind Kolekar", "rating": "5.0 out of 5 stars", "title": "Stunning Display, Productivity suite and UI. Look no further if you are over 30."},
{"body": "Best delivery speed by Amazon. ... phone has a bit heating issues... otherwise overall the phone is awesome. ..smooth as butter...! Best buy..go for it :)", "date": "13 June 2015", "author": "Aniruddh Betigeri", "rating": "4.0 out of 5 stars", "title": "super speed delivery!!"},
{"body": "Note 3 is for sure priced at the high end so some may say Samsung is overpricing this device like Apple does with theirs.Lets analyse.1) Stunning Display - Super AMOLED, 1080 x 1920 pixels, 5.7 inches (386ppi) with Corning Gorilla Glass 3 protection2) Quad-core 1.9 GHz Cortex-A15 & quad-core 1.3 GHz Cortex-A7 - Yes this has 2 processors inside one,powerful 1.9Ghz Cortex-15 cores are used for high end tasks,and 1.3 Ghz, battery efficient Cortex-A7 cores are in use when in idle and having to power up only simple tasks and apps.3) 3 GB of ram.4) Stylus Support( S-pen )- with great Stylus software additions built in. There is no other Android device having such a usable stylus software features.5) Android 4.4 Kitkat Upgradable - Update is available in India.6) Great Camera - One of the best you can get in an Android phone.7) Plethora of sensors - Accelerometer, gyro, proximity, compass, barometer, temperature, humidity, gesture8) A lot of software additions helping to do things with various gestures.9) Huge 3,200mAh battery.10) 32GB internal memory + microSD card (upto 64GB) slot.11) Multi-window features - This is built for great multitasking as you can open multiple apps in split screen for multitasking.One thing i dont like about this device is the design. This looks like any other Samsung product,apart from the fact that the back cover now has leather finish. Other manufacturers like Sony,HTC etc are pushing out quality metal/glass constructed well designed devices,why cant samsung do the same,at least on such a premium device !!Overall a great premium device,coming at a premium prize.You are getting what you are paying for.You are paying more for the software features it comes with,else it could have been priced around Rs 30000.This is for sure one of the best Android device in the market right now,but If you are not interested in all these software gimmicks note 3 comes with,or you dont like samsung's touchwiz interface,then i strongly recommend getting a Nexus 5 instead of this.With Nexus 5,you are gonna get faster software updates too.", "date": "25 January 2014", "author": "Mac", "rating": "4.0 out of 5 stars", "title": "Note 3 - A great high end phone with high end specs."},
{"body": "Phone delivery was on time and very good device.", "date": "24 July 2015", "author": "N DHANANJAYA", "rating": "5.0 out of 5 stars", "title": "Five Stars"},
{"body": "very nice mobile. thanks for delivering it.", "date": "23 July 2015", "author": "Rajiv P Saxena", "rating": "5.0 out of 5 stars", "title": "Five Stars"},
{"body": "Please don't buy any Samsung Smartphone Series.I faced lots of problem while using Samsung Galaxy Grand 19082GT. Automatically restart, Hanged, All applications won't work properly. I filed complaints in perherdar, all Indian consumer courts, I mailed to all shopping carts sites.If you want peace of mind then you have to not buying any Samsung Smart Phone Series.Thanks & Regards,Mehul Fozdar", "date": "23 August 2014", "author": "Mehul Kishorchandra Fozdar", "rating": "1.0 out of 5 stars", "title": "If you want peace of mind then you have to not buying any Samsung Smart Phone Series"},
{"body": "Over Priced... Must be a good one if available around 28 k. Also samsung is cheating Indian Customers by selling n9000 model which has low cost and low powered exsonus chipset and also low performance cpu. with only 1080p video recording. while selling n9005 model to usa and europe which has better qualcomm giant snapdragon 800 chipset and 4k video recording camera.. Indians are fool to buy this", "date": "9 November 2014", "author": "Nirav Jain", "rating": "2.0 out of 5 stars", "title": "Must be a good one if available around 28 k"},
{"body": "The best I have got so far..beautiful display with great stylus...love to write with stylus, compose mail. messages anything that needs typing.", "date": "5 July 2014", "author": "Vikas Sharma", "rating": "5.0 out of 5 stars", "title": "Beautiful as expected !!"},
{"body": "Your description says octa coreYour features says quad coreA little honesty please.DON'T CHEAT US.", "date": "3 December 2014", "author": "Vivek Jayachandran", "rating": "1.0 out of 5 stars", "title": "BUYER PROTECTION PLEASE"},
{"body": "Price is  very high", "date": "18 March 2015", "author": "sreenu", "rating": "3.0 out of 5 stars", "title": "price very high"},
{"body": "Great Phone", "date": "25 July 2015", "author": "Shirish S.", "rating": "4.0 out of 5 stars", "title": "Four Stars"},
{"body": "I purchased this phone couple of days ago and so far its been a good experience.Lot of bad had been said about this phablet.1.Built quality:Well that is true,built quality is plastic and not metal.Now this is a big phone with large display and heats up to 40°C,just think holding a metal sheet heated at that temperature.2.No LTE support,come on people 3g is just started in india and lte is a long way away,may be 2-3 years to fully impliment and prices of data on LTE to come down.you think you will be using Note3,three years from now.3.No 4k video recording:again same issue above,1080p has just started to be in main stream,leaving apart the huge storage required to save 4k video files.4. Over saturated colors of amoled screen:i love vivid colors and i am not a professional graphic artistic to look for color accuracy.5.No snap dragon processor,its like amd vs intel.yes intel is good but dont say amd is just bad.samsung chipset is a tad behind snapdragon.in actual day to day use you wont even notice the difference.Highly customization thanks to android 4.4,its buttery smooth,no lags or gitters at all that to 3gb ram,battery is 3100,good for full day of medium usage.Glitter on the crown the S Pen nothing even comes close to it,its not a marketing gimmick,its the best part of the note series and keeps on improving.I am not a samsung fanboy or an apple hater,i just love practical technology and my sammy note 3 works for me.", "date": "7 June 2014", "author": "Anish Shaikh", "rating": "4.0 out of 5 stars", "title": "Good Phone."},
{"body": "This phone has amazing battery duration time and wonderful camera which gives HD quality picturesthats why i switched from I phone 5 to Samsung Note 3. Size of the phone is slightly big but worth itsfunctions and battery time !!!", "date": "25 July 2014", "author": "athavale s a", "rating": "5.0 out of 5 stars", "title": "Excellent phone and battery"},
{"body": "First of all great delivery and packaging by Amazon. Fully recommended.I did not experience even a single issue wich r listed in other costumer reviews. I tested it for about 3 months n it's absolute pleasure.This has so many features tht till date I m discovering something new in this. All features r not used practically bt 95% of them r really useful n remaining r to show off.Those ppl facing probs r not understanding note 3This is a beast in all categories ; specs, benchmarks, value for money (if bought for 40k),Workaholic (works r done instantly), etc", "date": "21 July 2014", "author": "SIDDHARTH G.", "rating": "5.0 out of 5 stars", "title": "Plz don't get misguided by wrong reviews"},
{"body": "jst awesome. bit more expensive but really worth of it for long time. Which is nly flaw in this product. I thank amazon", "date": "28 May 2014", "author": "sumit kumar", "rating": "4.0 out of 5 stars", "title": "jst awesome !!!! Thanks amazon"},
{"body": "Configuration of Micromax Canvas Gold is better than this at less than half the price..", "date": "30 November 2014", "author": "Ritz", "rating": "1.0 out of 5 stars", "title": "One Star"},
{"body": "GOOG", "date": "21 October 2014", "author": "Prem Kumar", "rating": "5.0 out of 5 stars", "title": "Five Stars"},
{"body": "Great  purchase rapid delivery", "date": "4 October 2014", "author": "NANDKUMAR NAIR", "rating": "5.0 out of 5 stars", "title": "Great purchase rapid delivery"},
{"body": "Masttttt phone.... awesome", "date": "26 April 2015", "author": "saten", "rating": "5.0 out of 5 stars", "title": "essentially good..."},
{"body": "really good phone", "date": "26 August 2014", "author": "Balwant Singh \"Balzi\"", "rating": "5.0 out of 5 stars", "title": "Five Stars"},
{"body": "Power Packed !!! But Heats up like anything ... And lacks power backup Whenplaying games on the device it tends to getHOT after 15 min of game play, the volumebutton and power get really hot after 30 minof play time The phone with 100% change gotswitched off in just 5 hours of usage Everytime before switching the screen off I have toend all tasks just to keep it working as theRAM usage was showing 1.78GB all the time.Even when I have nothing on except thepower saver option it has a RAM usage of1.33GB Samsung needs to send a softwareupdate for this soon or else its back to theNote 2 Giving this device 3 stars Day 2: Tunsof software issues with the newsoftware, ,most of all, I CANT ACCESS MYCONTACT LIST ANY MOREMy advice go for the Note 2 more Reliable...", "date": "23 November 2013", "author": "SadiqTech75", "rating": "3.0 out of 5 stars", "title": "Power Packed !!! But Heats up like anything ..."},
{"body": "excellent!", "date": "30 December 2014", "author": "Ananth S Bhat", "rating": "5.0 out of 5 stars", "title": "Five Stars"},
{"body": "Super", "date": "19 January 2015", "author": "Suresh Kumar", "rating": "4.0 out of 5 stars", "title": "Four Stars"},
{"body": "Good", "date": "20 January 2015", "author": "Faisal Kunnathodi", "rating": "4.0 out of 5 stars", "title": "Four Stars"},
{"body": "good", "date": "20 January 2015", "author": "SOMESH THAREJA", "rating": "5.0 out of 5 stars", "title": "Five Stars"},
{"body": "Nice", "date": "27 November 2014", "author": "kappil kumar", "rating": "5.0 out of 5 stars", "title": "Five Stars"},
{"body": "I don't like this pic some problems in this puc", "date": "23 October 2014", "author": "sharanu", "rating": "1.0 out of 5 stars", "title": "R. Sharanu"}]