[[{"date": "13 June 2015", "body": "I am a user of a Galaxy note 3 that is 1.5 years old. I am a very heavy user who does a lot of calls and have whopping 29 gmail accounts (push always on), WhatsApp, Skype running at all times and this phone is the only one that lasts mr through the day.After an year the battery got weak but I easily changed it at home as it is user replaceable - ah the joy of having a phone with removable battery - take that Apple phones who charge 7-8k for replacing battery! I got mine from amazon for under 1500 directly from Samsung.This is a rock solid phone and none of its parts will fail - just make sure not to use it roughly and always have a metal bumper case around its sides.The bumper case will serve two purposes: 1st it will make your phone look cool (I got silver one for my black note 3) and elegant. Second it prevents the chrome from getting damaged.Verdict - This is the best phone on the market till now that does not compromise on performance and battery life.", "author": "Kamaldeep Singh", "rating": "5.0 out of 5 stars", "title": "Long time user review"},
{"date": "18 May 2015", "body": "I'm rating this drvice after a long use. The device is good from specs but as you know that the Samsung devices laggs too much. I was using the device from a long time and when i bought it, it works perfectly for the couple of weeks but after a month later, the device starts lagging too much which is not good for any consumer. The camera quality is really very impressive but it gets dull in low light. The device comes with 3GB of RAM but still it laggs. I have rated it 3 stars according to its specs and i must suggest to you that don't go for it. The device will completely disappoint you...", "author": "Rishabh A.", "rating": "3.0 out of 5 stars", "title": "Tech Reviewer"},
{"date": "1 June 2015", "body": "Lollipop update killed this phone. Higher ram usage and overheating  problems.", "author": "nimesh garg", "rating": "4.0 out of 5 stars", "title": "Lollipop  update"}][{"date": "13 June 2015", "body": "I am a user of a Galaxy note 3 that is 1.5 years old. I am a very heavy user who does a lot of calls and have whopping 29 gmail accounts (push always on), WhatsApp, Skype running at all times and this phone is the only one that lasts mr through the day.After an year the battery got weak but I easily changed it at home as it is user replaceable - ah the joy of having a phone with removable battery - take that Apple phones who charge 7-8k for replacing battery! I got mine from amazon for under 1500 directly from Samsung.This is a rock solid phone and none of its parts will fail - just make sure not to use it roughly and always have a metal bumper case around its sides.The bumper case will serve two purposes: 1st it will make your phone look cool (I got silver one for my black note 3) and elegant. Second it prevents the chrome from getting damaged.Verdict - This is the best phone on the market till now that does not compromise on performance and battery life.", "author": "Kamaldeep Singh", "rating": "5.0 out of 5 stars", "title": "Long time user review"},
{"date": "18 May 2015", "body": "I'm rating this drvice after a long use. The device is good from specs but as you know that the Samsung devices laggs too much. I was using the device from a long time and when i bought it, it works perfectly for the couple of weeks but after a month later, the device starts lagging too much which is not good for any consumer. The camera quality is really very impressive but it gets dull in low light. The device comes with 3GB of RAM but still it laggs. I have rated it 3 stars according to its specs and i must suggest to you that don't go for it. The device will completely disappoint you...", "author": "Rishabh A.", "rating": "3.0 out of 5 stars", "title": "Tech Reviewer"},
{"date": "1 June 2015", "body": "Lollipop update killed this phone. Higher ram usage and overheating  problems.", "author": "nimesh garg", "rating": "4.0 out of 5 stars", "title": "Lollipop  update"},
{"date": "7 July 2015", "body": "One of the best phone I have seen.. before using this phone I was using xperia z1 which was worst phone when compared to note 3 . Note 3 has many options apart from spending time on gaming. S pen is wonderful to use. It has special note option which will act like our diary where we can record our child activities with pics and more colorful template to each and every page. It has so many options to play around . Example eye sensor will stop playing videos when u turn ur face away from the device . S voice from Samsung is also excellent . It's worth for every penny . If we find less than 4 star in a review I'm sure that they have not used this device.Pros : excellent display with 5.7 inch . S pen . Performance . Camera , both picture and video quality is too good. So many useful options to play around .", "author": "Ponraj", "rating": "5.0 out of 5 stars", "title": "One of the best phone I have seen"},
{"date": "5 July 2015", "body": "Great phone at this price. I have used note 3 for about a year now and have not faced a single issue. The phone still does not lags. Yes the battery performance has been degraded after the lollipop update but still it is way better that other android devices and ofcos iphone. In about a year the phone has only hangged twice and that is when i had many apps oppened. The memory usage has been very high and stays at a higher level all the time after the lollipop update and the phone gets heated up really quick, but it does not affect the performance or battery.", "author": "Ayrijit Swain", "rating": "4.0 out of 5 stars", "title": "Great phone at this price"},
{"date": "12 June 2015", "body": "Not supports for 4G,overheating issues as normal like all electronic (radiation range high),audio quality must be improved as I review", "author": "laksusi", "rating": "1.0 out of 5 stars", "title": "True review"},
{"date": "25 July 2015", "body": "Device is to good in SpecificationsCamera Quality is GoodDisplay Quality is GreatPreloaded Application is UsefulUniversal Remote Works GreatThe Sensor's are Fully loaded Awesome Work by Samsung TeamJust The Issues is with BATTERY  LIFE after Charging the device 100 % and unplugged the device after 2 to 3 mins it will be 98 or 97%", "author": "Pratik Arun Jadhav", "rating": "2.0 out of 5 stars", "title": "Battery Drains Fully Without Using The Device in 8 to 9 hours"},
{"date": "1 August 2015", "body": "Hi, I got the 9005 version from ebay. Phone is great,  smooth. Good multitasking, display, battery backup, design(5out of 5). Camera could be better (4.0 out of 5). There is no manual Control over the camera (my L620 used to have this feature).  Launched in 2013, the specs beats even today's  present phone.", "author": "vishwanath", "rating": "5.0 out of 5 stars", "title": "Good phone"},
{"date": "13 June 2015", "body": "Best delivery speed by Amazon. ... phone has a bit heating issues... otherwise overall the phone is awesome. ..smooth as butter...! Best buy..go for it :)", "author": "Aniruddh Betigeri", "rating": "4.0 out of 5 stars", "title": "super speed delivery!!"},
{"date": "24 July 2015", "body": "Phone delivery was on time and very good device.", "author": "N DHANANJAYA", "rating": "5.0 out of 5 stars", "title": "Five Stars"},
{"date": "23 July 2015", "body": "very nice mobile. thanks for delivering it.", "author": "Rajiv P Saxena", "rating": "5.0 out of 5 stars", "title": "Five Stars"},
{"date": "25 July 2015", "body": "Great Phone", "author": "Shirish S.", "rating": "4.0 out of 5 stars", "title": "Four Stars"}]